app/controllers/cities_controller.rb

SELECT  `cities`.* FROM `cities` WHERE `cities`.`city_name` = 'Los Angeles' LIMIT 1
SELECT  `notes`.* FROM `notes` WHERE `notes`.`city_id` = 'search' LIMIT 1
SELECT `cities`.* FROM `cities`  ORDER BY created_at DESC
---
  def search
    String query = params[:search]
    query = "%"+query+"%"
    puts(query)
  #:set_city
#    @cities = City.all
 # pts(params[:search])
    if params[:search]
      @cities = City.where("city_name = ?",params[:search])

      @notes = Note.where("city_name = ?", params[:search])
    end
    #render "footprints/index"
     if @cities.empty?

SELECT `cities`.* FROM `cities` WHERE (city_name = '%Los Angeles%')
---
    def set_city
      @city = City.find_by_city_name(params[:search])