app/controllers/footprints_controller.rb

  def index
    @footprints = Footprint.all
---
SELECT "footprints".* FROM "footprints"

  def create
    @footprint = Footprint.new(footprint_params)

    respond_to do |format|
      if @footprint.save
---
INSERT INTO "footprints" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-10-17 00:12:48.041848"], ["updated_at", "2015-10-17 00:12:48.041848"]]

    def set_footprint
      @footprint = Footprint.find(params[:id])
---
SELECT  "footprints".* FROM "footprints" WHERE "footprints"."id" = ? LIMIT 1  [["id", 1]]