app/controllers/notes_controller.rb

SELECT  `notes`.* FROM `notes` WHERE `notes`.`id` = 8 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`note_id` = 1
---
  def show
    @user = current_user
    @noteComments = @note.comments.includes(:user).where('notes.id = ?',@notes)

INSERT INTO `notes` (`title`, `city_name`, `content`, `tags`, `created_at`, `updated_at`) VALUES ('London financial hub', 'London', 'abc', 'finance', '2015-11-05 03:29:09', '2015-11-05 03:29:09')
---
  def create
    @note = Note.new(city_name:note_params[:city_name],title:note_params[:title],content:note_params[:content])
    note_categories = note_params[:categories]
    note_categories.delete("")
    note_categories.each  do |i|
      c = Category.find_by_name(i)
      @note.categories << c