app/controllers/users_controller.rb

  def show
    #@user = current_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def show_categories
    @user =  current_user
    @allcategories = Category.all
---
SELECT `categories`.* FROM `categories`